создание функции is_palindrome с оргументом s
создание переменной tmp со значением s
переворвчиваем значение переменной tmp
печать s
печать tmp

если tmp равняется s, то возвратить Правда
иначе ничего

создание функции word с оргументом n 
создание пустого списка result
создание цикла с переменной i, повторяющегося n раз
создание переменной element со значением пользовательского ввода внутри цикла for
добавление к списку получившегося ввода
если функция is_palindrome с оргументом result - Правда, то вывод result это палиндром
иначе вывод result это непалиндром

